# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

def intersection(x1, y1, x2, y2, r1, r2):
    if ((r2 - r1) ** 2 > (x2 - x1) ** 2 + (y2 - y1) ** 2):
        return True
    return False


x1 = float(input("Введите координату x центра первой окружности: "))
y1 = float(input("Введите координату y центра первой окружности: "))
x2 = float(input("Введите координату x центра второй окружности: "))
y2 = float(input("Введите координату y центра второй окружности: "))
r1 = float(input("Введите радиус первой окружности: "))
r2 = float(input("Введите радиус второй окружности: "))
print(intersection(x1, y1, x2, y2, r1, r2))

