## "Число Фибоначчи"

### Задание

По данному числу n определите n-е [число Фибоначчи](https://ru.wikipedia.org/wiki/%D0%A7%D0%B8%D1%81%D0%BB%D0%B0_%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8).

### Формат входных данных

Дано целое положительное число n, номер числа Фибоначчи в последовательности.

### Формат выходных данных

Вывести число Фибоначчи с номером n.


### Решение задачи

```python
n = int(input("Введите положительный номер числа в последовательности Фибоначчи: "))
f = 0  # число Фибоначчи
f1 = 1  # предыдущее число Фибоначчи
f2 = 0  # предпредыдущее число Фибоначчи
a = 2
if n >= 2:
    while a <= n:
        f = f1 + f2
        f2 = f1
        f1 = f
        a += 1
    print("Число из последовательности Фибоначчи: ", f)
elif n == 1:
    print("Число из последовательности Фибоначчи: ", 1)
else:
    print("Число из последовательности Фибоначчи: ", 0)

```

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    1    | 0 |
|    4    | 2 |
|    7    | 8  |
|    11    | 55 |
