## "Бесконечный ввод и подсчет положительных"

### Задание

С клавиатуры вводятся целые числа, до тех пор пока не будет введена строка "стоп". \
Посчитайте количество положительных чисел, среди введенных.

### Формат входных данных

Вводятся целые числа, пока не будет введено "стоп".

### Формат выходных данных

Вывести количество положительных.

### Решение задачи

```python
n = int(input("Введите целое число, количество чисел: "))
count_positive = 0
a = 0
while a < n:
    m = int(input("Введите число: "))
    if m > 0:
        count_positive += 1
    a += 1
print("Количество положительных чисел: ", count_positive)

```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Смотри пример "Выполнение цикла пока не будет введено нужное значение"
</details>
