## "Лесенка символами"

### Задание

Вывести лесенку из n ступенек символами *. \
Смотри пример.

### Формат входных данных

Дано целое число n, количество ступенек. 1 < n < 20

### Формат выходных данных

Вывести лесенку символами *(звездочка)

#### Примеры

n = 3 
```
*
**
***
```
n = 5
```
*
***
****
*****
```

### Решение задачи

```python
n = int(input("Введите n больше 1, но меньше 20: "))
count = 0
step = "*"
while count < n:
    print(step)
    step = step + "*"
    count += 1

```

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Если строку умножить на число n, то строка дублируется n-раз:

```python
s = "0"
s = s * 5 # s = "00000" 
```
</details>
