# Дан размер стороны квадрата. Вывести его стороны символами #.
# Формат входных данных
# На вход программе одно целое число a (2<a≤30) - сторона квадрата.
# Формат выходных данных
# Требуется вывести диагонали символами # (см. пример)

# Пример:
# Входные данные
# 6
# Выходные данные
######
#    #
#    #
#    #
#    #
######
length = int(input("Введите сторону квадрата больше 2, но меньше или равную 30: "))
if length <= 2 or length > 30:
    print("Вы ввели не верную длину стороны")
else:
    horizontal = "#" * length
    print(horizontal)
    vertical = "#" + " " * (length - 2) + "#"
    for i in range(0, (length - 2)):
        print(vertical)
    print(horizontal)
