# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
for item in names:
    print(item, end=", ")


# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
