# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
lenght_name = 0
name = ""
for item in names:
    if len(item) > lenght_name:
        lenght_name = len(item)
        name = item
print("Одно из самых длинных имен: ", name)

